erp3l/src/Catalogs/Л3_КонстантыНетиповыхАлгоритмов/Л3_КонстантыНетиповыхАлгоритмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Л3_КонстантыНетиповыхАлгоритмов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/CommonModules/л3_СерверПовтИсп/Module.bsl
Функция ЗначениеНетиповойКонстанты(ИмяКонстанты) Экспорт
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(ИмяКонстанты) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	з.Значение КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		Л3_КонстантыНетиповыхАлгоритмовСписок.Значение КАК Значение
			|	ИЗ
			|		Справочник.Л3_КонстантыНетиповыхАлгоритмов.Список КАК Л3_КонстантыНетиповыхАлгоритмовСписок
			|	ГДЕ
			|		Л3_КонстантыНетиповыхАлгоритмовСписок.Ссылка.Наименование = &Наименование
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Л3_КонстантыНетиповыхАлгоритмов.Значение
			|	ИЗ
			|		Справочник.Л3_КонстантыНетиповыхАлгоритмов КАК Л3_КонстантыНетиповыхАлгоритмов
			|	ГДЕ
			|		Л3_КонстантыНетиповыхАлгоритмов.Наименование = &Наименование) КАК з
			|ГДЕ
			|	з.Значение <> НЕОПРЕДЕЛЕНО";
		
		Запрос.УстановитьПараметр("Наименование", ИмяКонстанты);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() = 1 Тогда
			Результат = ТЗ[0].Значение;
		ИначеЕсли ТЗ.Количество() > 1 Тогда
			Результат = ТЗ.ВыгрузитьКолонку("Значение");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
